Repository: liraymond04/lotm-subs
Catalog: ep10/ep10-omegat/omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 雪伦夫人的继子
en_us: Madam Sharon's stepson.

source: 霍伊男爵遗
en_us: Baron Khoy's widow.

source: 非凡世界
en_us: The world of Beyonders.

source: 非凡者失控死亡后
en_us: After a Beyonder loses control and dies,

source: 非凡能力越强
en_us: the greater the Beyonder abilities.

source: 鞋底的土
en_us: The dirt on your shoes,

source: 预计明年年初
en_us: Early next year, it's projected

source: 风险较大
en_us: is high-risk.

source: 飓风中将
en_us: Vice Admiral Hurricane

source: 高序列强者
en_us: High-Sequence Beyonders

source: 鲁恩语的源头古弗萨克语
en_us: The root language of Loenese, Ancient Feysac!

source: 默许了事情的发生
en_us: tacitly allowing these events to unfold.

source: 齐林格斯
en_us: Qilangos.
